CSI API ETABS v1
cPointElm.GetCoordCartesian Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCoordCartesian(
	string Name,
	ref double X,
	ref double Y,
	ref double Z,
	string CSys = "Global"
)
Function GetCoordCartesian (
	Name As String,
	ByRef X As Double,
	ByRef Y As Double,
	ByRef Z As Double,
	Optional CSys As String = "Global"
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim X As Double
Dim Y As Double
Dim Z As Double
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetCoordCartesian(Name,
	X, Y, Z, CSys)
int GetCoordCartesian(
	String^ Name,
	double% X,
	double% Y,
	double% Z,
	String^ CSys = L"Global"
)
abstract GetCoordCartesian :
        Name : string *
        X : float byref *
        Y : float byref *
        Z : float byref *
        ?CSys : string
(* Defaults:
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
X
Type: System.Double
Y
Type: System.Double
Z
Type: System.Double
CSys (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace